#2025/05/03作成

#2025/03/04追加　新しいブロック分け
#2025/04/14 三重県の所属を近畿ブロックへ変更
new_block_mapping = {
    "京都府":["京都府"],
    "大阪府":["大阪府"],
    "滋賀県":["滋賀県"],
    "東京都":["東京都"],
    "近畿圏ブロック":["兵庫県","奈良県","和歌山県","三重県"],
    "首都圏ブロック":["神奈川県","千葉県","埼玉県"],
    "北海道・東北・北関東ブロック":["北海道","青森県","秋田県","岩手県","宮城県","福島県","山形県","茨城県","栃木県","群馬県"],
    "中部ブロック":["愛知県","静岡県","岐阜県","山梨県","長野県","新潟県","富山県","石川県","福井県"],
    "中国・四国ブロック":["岡山県","広島県","鳥取県","島根県","山口県","徳島県","香川県","愛媛県","高知県"],
    "九州・沖縄ブロック":["福岡県","佐賀県","長崎県","熊本県","鹿児島県","大分県","宮崎県","沖縄県"]
}

#居住地分類関数
def new_classify_resi_block(prefecture):
    for block,prefectures in new_block_mapping.items():
        if prefecture.strip() in prefectures:
            return block
    return "その他" #該当しない場合

#2025/03/06 先生から教えていただいた業種のまとめ
ind_dict = {
    "飲食店":['122_酒飲食', '124_料理店', '121_軽飲食', '123_特別飲食'],
    "コンビニスーパー":['021_ｽｰﾊﾟｰ', '031_ｺﾝﾋﾞﾆ', '996_小売'],
    "衣料関連":['051_衣料', '052_衣料付属', '053_紳士服'],
    "家電家具":['071_家電', '062_家具', '063_小売（家具HC）'],
    "041_SPｾﾝﾀｰ":['041_SPｾﾝﾀｰ'],
    "061_ﾎｰﾑC":['061_ﾎｰﾑC'],
    "042_駅ビル":['042_駅ビル'],
    "011_百貨店":['011_百貨店'],
    "081_ﾄﾞﾗｯｸﾞ":['081_ﾄﾞﾗｯｸﾞ'],
    "992_ｽﾎﾟｰﾂ用品":['992_ｽﾎﾟｰﾂ用品'],
    "994_書籍・文具":['994_書籍・文具'],
    "交通機関":['181_タクシー', '183_鉄道', '184_その他交通'],
    "141_宿泊施設":['141_宿泊施設'],
    "171_旅行代理店":['171_旅行代理店'],
    "995_理美容":['995_理美容'],
    "131_医療":['131_医療'],
    "娯楽":['161_ｴﾝﾀﾒ', '151_ｺﾞﾙﾌ場'],
    "991_ｽｸｰﾙ･ｽﾎﾟｰﾂ":['991_ｽｸｰﾙ･ｽﾎﾟｰﾂ'],
    "993_冠婚葬祭":['993_冠婚葬祭'],
    "車両関連":['101_ﾃﾞｨｰﾗｰ', '102_車両その他', '103_小売（車両）'],
    "エネルギー":['111_SS', '241_ガス'],
    "その他":['99x_その他'],
    "091_貴金属":['091_貴金属']
}

#業種分類用関数
def classify_ind_block(ind):
    for block,indstries in ind_dict.items():
        if ind.strip() in indstries:
            return block
    return "その他" #該当しない場合

def classify(df):
    df["residence_block"] = df["resi1"].apply(new_classify_resi_block) #居住地ブロック適用
    df["ind_block"] = df["ind"].apply(classify_ind_block) #産業ブロック適用
    return df